In [1]:
from pathlib import Path

import boto3
import pandas as pd
from decouple import config

In [2]:
AWS_SECRET_ACCESS_KEY_ID=config('AWS_SECRET_ACCESS_KEY_ID')
AWS_SECRET_ACCESS_KEY=config('AWS_SECRET_ACCESS_KEY')
REGION_NAME=config('REGION_NAME')

In [3]:
# Set up AWS credentials and S3 bucket details
s3 = boto3.client('s3',
                  aws_access_key_id=AWS_SECRET_ACCESS_KEY_ID,
                  aws_secret_access_key=AWS_SECRET_ACCESS_KEY,
                  region_name=REGION_NAME
                  )

In [4]:
data_dir = Path("data")
data_dir.mkdir(parents=True, exist_ok=True)

In [5]:
bucket_name = 'bankloanportfolio'
file_name1 = 'Account.csv'
file_name2 = 'Client.csv'
file_name3 = 'Loan.csv'
file_name4 = 'District.csv'

files = [file_name1, file_name2, file_name3, file_name4]

In [6]:
objects = [s3.get_object(Bucket=bucket_name, Key=file) for file in files]
dataframes = []

# In the script will decompose and turn into functions
for file, object in zip(files,objects):
    file_path = data_dir/file
    file_path.write_bytes(object['Body'].read())
    dataframes.append(pd.read_csv(file_path))

In [7]:
accounts_df, client_df, loan_df, district_df = dataframes

In [8]:
accounts_df.describe()

         account_id  district_id
count   4499.000000  4499.000000
mean    2786.558791    37.306513
std     2313.834479    25.178634
min        1.000000     1.000000
25%     1183.500000    13.000000
50%     2369.000000    38.000000
75%     3552.500000    60.000000
max    11382.000000    77.000000

In [9]:
# Display the first few rows of each DataFrame
print("Account DataFrame:")
accounts_df.head()

Account DataFrame:

   account_id  district_id statement_freq        date
0        3818           74        Monthly  1993-01-01
1         704           55        Monthly  1993-01-01
2        2378           16        Monthly  1993-01-01
3        2632           24        Monthly  1993-01-02
4        1972           77        Monthly  1993-01-02

In [10]:
# Display the first few rows of each DataFrame
print("Client DataFrame:")
client_df.head()

Client DataFrame:

   client_id  district_id  gender DateOfBirth
0          1           18  Female  1970-12-13
1          2            1    Male  1945-02-04
2          3            1  Female  1940-10-09
3          4            5    Male  1956-12-01
4          5            5  Female  1960-07-03

In [11]:
# Display the first few rows of each DataFrame
print("Loan DataFrame:")    
loan_df.head()

Loan DataFrame:

,loan_id,account_id,date,amount,duration,payments,contract_status,isdebt
0,5314,1787,1993-07-05,96396,12,8033,Contract Closed,Yes
1,5316,1801,1993-07-11,165960,36,4610,Contract Closed,No
2,6863,9188,1993-07-28,127080,60,2118,Contract Closed,No
3,5325,1843,1993-08-03,105804,36,2939,Contract Closed,No
4,7240,11013,1993-09-06,274740,60,4579,Contract Closed,No

In [12]:
# Display the first few rows of each DataFrame
print("District DataFrame:")
district_df.head()

District DataFrame:

,dis_code,dis_name,Region,NoInhb,Munclt499,Muncllt2000,Muncllt3000,Muncllt10000,NoOfCities,RatioUrbInhb,Avg_Salary,UnempRate95,UnempRate96,NoOfEnrpr1000hb,commitcrime95,commitcrime96,entpr_rate,crime_rate
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107,0.17,0.07
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674,0.13,0.02
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813,0.11,0.04
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892,0.11,0.03
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040,0.12,0.03

In [13]:
accounts_df.isnull().sum()

account_id        0
district_id       0
statement_freq    0
date              0
dtype: int64

In [14]:
client_df.isnull().sum()

client_id      0
district_id    0
gender         0
DateOfBirth    0
dtype: int64

In [15]:
loan_df.isnull().sum()

loan_id            0
account_id         0
date               0
amount             0
duration           0
payments           0
contract_status    0
isdebt             0
dtype: int64

In [16]:
district_df.isnull().sum()

dis_code           0
dis_name           0
Region             0
NoInhb             0
Munclt499          0
Muncllt2000        0
Muncllt3000        0
Muncllt10000       0
NoOfCities         0
RatioUrbInhb       0
Avg_Salary         0
UnempRate95        0
UnempRate96        0
NoOfEnrpr1000hb    0
commitcrime95      0
commitcrime96      0
entpr_rate         0
crime_rate         0
dtype: int64

In [17]:
accounts_df.columns, client_df.columns, loan_df.columns, district_df.columns

(Index(['account_id', 'district_id', 'statement_freq', 'date'], dtype='object'),
 Index(['client_id', 'district_id', 'gender', 'DateOfBirth'], dtype='object'),
 Index(['loan_id', 'account_id', 'date', 'amount', 'duration', 'payments',
        'contract_status', 'isdebt'],
       dtype='object'),
 Index(['dis_code', 'dis_name', 'Region', 'NoInhb', 'Munclt499', 'Muncllt2000',
        'Muncllt3000', 'Muncllt10000', 'NoOfCities', 'RatioUrbInhb',
        'Avg_Salary', 'UnempRate95', 'UnempRate96', 'NoOfEnrpr1000hb',
        'commitcrime95', 'commitcrime96', 'entpr_rate', 'crime_rate'],
       dtype='object'))

In [18]:
# Rename columns for consistency
district_df.rename(columns={'dis_code':'district_id'}, inplace=True)
district_df.columns

Index(['district_id', 'dis_name', 'Region', 'NoInhb', 'Munclt499',
       'Muncllt2000', 'Muncllt3000', 'Muncllt10000', 'NoOfCities',
       'RatioUrbInhb', 'Avg_Salary', 'UnempRate95', 'UnempRate96',
       'NoOfEnrpr1000hb', 'commitcrime95', 'commitcrime96', 'entpr_rate',
       'crime_rate'],
      dtype='object')

In [19]:
# Merge DataFrames to create the client file
client_file =pd.merge(accounts_df,client_df,how='inner',on='district_id')
client_file.head()

,account_id,district_id,statement_freq,date,client_id,gender,DateOfBirth
0,3818,74,Monthly,1993-01-01,26,Female,1969-04-20
1,3818,74,Monthly,1993-01-01,30,Female,1957-10-09
2,3818,74,Monthly,1993-01-01,92,Female,1966-06-12
3,3818,74,Monthly,1993-01-01,96,Male,1972-02-29
4,3818,74,Monthly,1993-01-01,102,Female,1958-09-10

In [20]:
client_file = pd.merge(client_file[['account_id','district_id','statement_freq','client_id','gender','DateOfBirth']],loan_df,how='inner',on='account_id')
client_file.head()

,account_id,district_id,statement_freq,client_id,gender,DateOfBirth,loan_id,date,amount,duration,payments,contract_status,isdebt
0,5270,44,Monthly,100,Female,1942-08-11,6077,1993-11-22,79608,24,3317,Contract Closed,No
1,5270,44,Monthly,124,Male,1967-09-21,6077,1993-11-22,79608,24,3317,Contract Closed,No
2,5270,44,Monthly,235,Female,1943-08-28,6077,1993-11-22,79608,24,3317,Contract Closed,No
3,5270,44,Monthly,343,Male,1919-11-19,6077,1993-11-22,79608,24,3317,Contract Closed,No
4,5270,44,Monthly,471,Male,1977-01-11,6077,1993-11-22,79608,24,3317,Contract Closed,No

In [21]:
client_file = pd.merge(client_file,district_df[['district_id', 'dis_name', 'Region','Avg_Salary', 'UnempRate95', 'UnempRate96']],how='inner',on='district_id')
client_file.head()

,account_id,district_id,statement_freq,client_id,gender,DateOfBirth,loan_id,date,amount,duration,payments,contract_status,isdebt,dis_name,Region,Avg_Salary,UnempRate95,UnempRate96
0,5270,44,Monthly,100,Female,1942-08-11,6077,1993-11-22,79608,24,3317,Contract Closed,No,Chrudim,east Bohemia,8254,2.79,3.76
1,5270,44,Monthly,124,Male,1967-09-21,6077,1993-11-22,79608,24,3317,Contract Closed,No,Chrudim,east Bohemia,8254,2.79,3.76
2,5270,44,Monthly,235,Female,1943-08-28,6077,1993-11-22,79608,24,3317,Contract Closed,No,Chrudim,east Bohemia,8254,2.79,3.76
3,5270,44,Monthly,343,Male,1919-11-19,6077,1993-11-22,79608,24,3317,Contract Closed,No,Chrudim,east Bohemia,8254,2.79,3.76
4,5270,44,Monthly,471,Male,1977-01-11,6077,1993-11-22,79608,24,3317,Contract Closed,No,Chrudim,east Bohemia,8254,2.79,3.76

In [22]:
client_file.to_csv("data/bank_loan.csv", index=False)